Revit 2024 API
LoadClassification Enumeration
 An enumerated type to list all demand factor classifications.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum LoadClassification
Visual Basic
Public Enumeration LoadClassification
Visual C++
public enum class LoadClassification
Members
Member name | Description
Undefined |  Load classification is undefined.
Power |  Load classification is power.
Lighting |  Load classification is Lighting.
Hvac |  Load classification is HVAC.
See Also
Autodesk.Revit.DB.Electrical Namespace